import Foundation
var moves = ["ТопРок","Индиан Степ","Сальса Степ","6 степ","6 степ (вариация)","CC","CC на спине","Флор рок (мини промокашка)","Циркуль","3 степ","4 степ","Бейби лав","Зулу спин","Вэб","Гелик","Свайп","Свайп на двух ногах","Бочка","Тартл","Джекхаммер","Бэкспин","Флаер","99","Хедспин","Хало","Бейби фриз","Бейби фриз (вариация)","Чеир","Эир бейби","Бэк/полубэк","Фриз на плече","Фриз на локте","Фриз на руках","Фриз на руке","Фриз на голове"]
var x = Int(arc4random_uniform(3)+4)
print("Связка из ", x, "движений:","\n")

var breakFlow = [String]()
while breakFlow.count < x {
    var new_val = String()              //пустой массив
    let randomIndex = Int(arc4random_uniform(UInt32(moves.count)))
    new_val = moves[randomIndex]        //случайный элемент массива
    if new_val != breakFlow.last {      //сравнение нового элемента с последним имеющимся
        breakFlow.append(new_val)       //дополняем новый массив
    }
}
breakFlow.forEach() { print($0) }































